In [4]:
import pandas as pd

df = pd.read_csv("../Data/Mumbai House Prices.csv")
df.head()

,bhk,type,locality,area,price,price_unit,region,status,age
0,3,Apartment,Lak And Hanware The Residency Tower,685,2.50,Cr,Andheri West,Ready to move,New
1,2,Apartment,Radheya Sai Enclave Building No 2,640,52.51,L,Naigaon East,Under Construction,New
2,2,Apartment,Romell Serene,610,1.73,Cr,Borivali West,Under Construction,New
3,2,Apartment,Soundlines Codename Urban Rainforest,876,59.98,L,Panvel,Under Construction,New
4,2,Apartment,Origin Oriana,659,94.11,L,Mira Road East,Under Construction,New

In [9]:

print("Missing values:")
df.isnull().sum()

Missing values:

bhk           0
type          0
locality      0
area          0
price         0
price_unit    0
region        0
status        0
age           0
dtype: int64

In [10]:
print("\nData types:")
df.dtypes

Data types:

bhk             int64
type           object
locality       object
area            int64
price         float64
price_unit     object
region         object
status         object
age            object
dtype: object

In [13]:
df.shape

(76038, 9)

In [14]:
df = df.drop_duplicates()

In [16]:
print("Shape after removing duplicates:", df.shape)

Shape after removing duplicates: (55726, 9)

In [17]:
df.isnull().sum()

bhk           0
type          0
locality      0
area          0
price         0
price_unit    0
region        0
status        0
age           0
dtype: int64

In [26]:
df['price_unit'].unique()

array(['Cr', 'L'], dtype=object)

In [27]:
# Convert Crore to Lakh
df.loc[df['price_unit'] == 'Crore', 'price'] = df['price'] * 100

In [28]:
print("Conversion complete!")
print(df['price_unit'].unique())

Conversion complete!
['Cr' 'L']

In [29]:
# Optional: keep only one unit
df['price_unit'] = 'Lakh'

In [30]:
df[['price', 'price_unit']].head()

    price price_unit
0  250.00       Lakh
1   52.51       Lakh
2  173.00       Lakh
3   59.98       Lakh
4   94.11       Lakh

In [32]:
df['age'].unique()[:40]

array(['New', 'Resale', 'Unknown'], dtype=object)

In [33]:
age_mapping = {
    'New': 0,
    'Resale': 1,
    'Unknown': 1
}

df['age'] = df['age'].map(age_mapping)

In [34]:
df['age'].unique()
df['age'].dtype

dtype('int64')

In [35]:
df.dtypes

bhk             int64
type           object
locality       object
area            int64
price         float64
price_unit     object
region         object
status         object
age             int64
dtype: object

In [36]:
df = df[['bhk', 'area', 'price', 'age', 'type', 'locality', 'region', 'status']]

In [37]:
df.head()
df.shape

(55726, 8)

In [38]:
df.to_csv("../Data/cleaned_data.csv", index=False)